read_verilog -sv state-oh.v
read_liberty -lib ../osu018_stdcells.lib
proc
flatten
synth -auto-top
write_verilog synth.v
dfflibmap -liberty ../osu018_stdcells.lib
abc -D 5000 -liberty ../osu018_stdcells.lib
stat -liberty ../osu018_stdcells.lib
write_verilog gate.v
show
